web/tutorials/precice/to_openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/Parameters"
convertToMeters 1.0;

Ny_air #calc "ceil( ($h - $waterHeight) / $dy )";
dy_air #calc "($h - $waterHeight) / $Ny_air"; //true dy
Ny_mid #calc "round( ($waterHeight - $skewCellHeight) / $dy_air )";
skewCellHeight_final #calc "$waterHeight - ($Ny_mid * $dy_air)";

Ny_top #calc "$Ny_air + $Ny_mid";
Ny_bottom  #calc "ceil($skewCellHeight_final / $dy)";
Nx_channel  #calc "ceil($l1 / ($dx_to_dy * $dy))";
Nx_channel2  #calc "ceil(($l-$l1) / ($dx_to_dy * $dy))"; Nx_diffusor  #calc "ceil(0.5 * $waterHeight / (0.075 * $dx_to_dy * $dy))"; // 0.5 is an estimate



xcells 100; 
ycells 120; 
zcells 1;

vertices
(
    (1.0 0.0 0) // 0
    (1.0 0.12 0) // 1
    (1.0 0.0 1) // 2
    (1.0 0.12 1)// 3
    (0.5 0.0 0) // 4
    (0.5 0.12 0) // 5
    (0.5 0.0 1) // 6
    (0.5 0.12 1) // 7
);

blocks
(
hex (4 0 1 5 6 2 3 7) pipe ($xcells $ycells $zcells)  edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
);

edges
(
);


patches
(

    patch walls
    (
        (0 4 6 2)
    )

    patch atmosphere
    (
        (1 3 7 5)
    )
    
    patch inlet
    (
        (4 5 7 6)            
    )
    
    patch outlet
    (
        (0 2 3 1)
    )
);

boundaries
(
    emptyWalls
    {
        type    empty;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        )
    }   
);

mergePatchPairs
(
);

